system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.openfoam.com; www.openfoam.org    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         3000;//
deltaT          1;
writeControl    timeStep;
writeInterval   50;//
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
functions
{
   
forceCoeffs1
{
    // Mandatory entries
    type            forceCoeffs;
    libs            ("libforces.so");
    patches         (wall1);


    // Optional entries

    // Field names
    p               p;
    U               U;
    rho             rhoInf;
    rhoInf          1.225;

    // Reference pressure [Pa]
    pRef            0;

    // Include porosity effects?
    porosity        no;

    // Store and write volume field representations of forces and moments
    // writeFields     yes;

    // Centre of rotation for moment calculations
    CofR            (0.05 0 0.0);

    // Lift direction
    liftDir         (-0.0697564737441253 0.997564050259824 0);

    // Drag direction
    dragDir         (0.997564050259824 0.0697564737441253 0);

    // Pitch axis
    pitchAxis       (0 0 1);

    // Freestream velocity magnitude [m/s]
    magUInf         25;

    // Reference length [m]
    lRef            0.25;

    // Reference area [m2]
    Aref            0.1875;

    // Spatial data binning
    // - extents given by the bounds of the input geometry
    binData
    {
        nBin        20;
        direction   (1 0 0);
        cumulative  yes;
    }
}

forces
{
    type            forces;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (wall1);
    p               p;
    U               U;
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;           // Required when rho = rhoInf
    pRef            0;
    liftDir         (-0.0697564737441253 0.997564050259824 0);
    dragDir         (0.997564050259824 0.0697564737441253 0);
    CofR            (0.05 0 0.0);  // Axle midpoint on ground
    pitchAxis       (0 0 1);
    magUInf         25;
    
}

}

// ************************************************************************* //
