system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.openfoam.com; www.openfoam.org    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}
gradSchemes
{
    default         Gauss linear;

    // default         none;
    // grad(p)     faceMDLimited edgeCellsLeastSquares 1;
    // grad(U)     faceMDLimited edgeCellsLeastSquares 1;
    // grad(omega)     faceLimited edgeCellsLeastSquares 1;
    // grad(epsilon)     faceLimited edgeCellsLeastSquares 1;
    // grad(k)     faceLimited edgeCellsLeastSquares 1;

    // default         none;
    // grad(p)     faceMDLimited Gauss linear 1;
    // grad(U)     faceMDLimited Gauss linear 1;
    // grad(omega)     faceLimited Gauss linear 1;
    // grad(epsilon)     faceLimited Gauss linear 1;
    // grad(k)     faceLimited Gauss linear 1;
}
divSchemes
{
    // default         none;
    // div(phi,U)      bounded Gauss linear;
    // div(phi,k)      bounded Gauss linearUpwind grad(k);
    // div(phi,omega)  bounded Gauss linearUpwind grad(omega);
    // div(phi,epsilon)  bounded Gauss linearUpwind grad(epsilon);
    // div((nuEff*dev2(T(grad(U))))) Gauss linear;

    default         none;
    div(phi,U)      bounded Gauss upwind;
    div(phi,k)      bounded Gauss upwind;
    div(phi,omega)  bounded Gauss upwind;
    div(phi,epsilon)  bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
    default         Gauss linear limited 0.5;
}
interpolationSchemes
{
    default         linear;
}
snGradSchemes
{
    default         limited 0.5;
}
wallDist
{
    method meshWave;
}


// ************************************************************************* //
