system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.openfoam.com; www.openfoam.org    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

        // Valid symmetric matrix solver types :
		// 7(FPCG GAMG PBiCGStab PCG PPCG PPCR smoothSolver)

    p
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          1e-06;
        // smoother        GaussSeidel;
    }
    "(U|k|epsilon|omega)"
    {
        solver          GAMG;
        smoother        symGaussSeidel;
        tolerance       1e-06;//
        relTol          1e-06;//
    }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;
    residualControl
    {
        p               1e-6;//
        U               1e-6;//
        "(k|epsilon|omega)" 1e-6;//
    }
}
relaxationFactors
{
    equations
    {
        U               0.3; //
        k               0.3; //
        epsilon         0.3;//
        omega           0.3;//
    }
	fields
	{
		p               0.3;//
	}
}


// ************************************************************************* //
