system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.openfoam.com; www.openfoam.org    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    castellatedMesh true;
    snap            true;
    addLayers       false;//true;

    geometry
    {
      inlet1.stl{ type triSurfaceMesh; name inlet1;}
      inlet2.stl{ type triSurfaceMesh; name inlet2;}
//       inlet3.stl{ type triSurfaceMesh; name inlet3;}
//       inlet4.stl{ type triSurfaceMesh; name inlet4;}
//       inlet5.stl{ type triSurfaceMesh; name inlet5;}
      outlet1.stl{ type triSurfaceMesh; name outlet1;}
//       outlet2.stl{ type triSurfaceMesh; name outlet2;}
//       outlet3.stl{ type triSurfaceMesh; name outlet3;}
//       outlet4.stl{ type triSurfaceMesh; name outlet4;}
//       outlet5.stl{ type triSurfaceMesh; name outlet5;}
      wall1.stl{ type triSurfaceMesh; name wall1;}
//       wall2.stl{ type triSurfaceMesh; name wall2;}
//       wall3.stl{ type triSurfaceMesh; name wall3;}
//       wall4.stl{ type triSurfaceMesh; name wall4;}
//       wall5.stl{ type triSurfaceMesh; name wall5;}
      symmetry1.stl{ type triSurfaceMesh; name wall5;}
    wake {type searchableBox; min (-0.2 -0.2 -1); max (3.1 0.2 0.2);}
    vertical {type searchableBox; min (-0.2 -2.2 -1); max (0.5 2.2 0.2);}
    buffer1 {type searchableBox; min (-1 -0.5 -1); max (1.2 0.5 0);}
    buffer2 {type searchableBox; min (-2 -1 -2); max (2 1 0);}
    }

    castellatedMeshControls
    {
        maxLocalCells 1000000;
        maxGlobalCells 80000000;
        minRefinementCells 0;
        maxLoadUnbalance 0.10;
        nCellsBetweenLevels 3;
        features
        (
//          { file inlet1.eMesh; level 2;}
//          { file inlet2.eMesh; level 2;}
//          { file inlet3.eMesh; level 2;}
//          { file inlet4.eMesh; level 2;}
//          { file inlet5.eMesh; level 2;}
//          { file outlet1.eMesh; level 2;}
//          { file outlet2.eMesh; level 2;}
//          { file outlet3.eMesh; level 2;}
//          { file outlet4.eMesh; level 2;}
//          { file outlet5.eMesh; level 2;}
         { file wall1.eMesh; level 4;}
//          { file wall2.eMesh; level 2;}
//          { file wall3.eMesh; level 2;}
//          { file wall4.eMesh; level 2;}
//          { file wall5.eMesh; level 2;}
        );
        refinementSurfaces
        {
//          inlet1{ level (2 2); patchInfo{type patch;}}
//          inlet2{ level (2 2); patchInfo{type patch;}}
//          inlet3{ level (2 2); patchInfo{type patch;}}
//          inlet4{ level (2 2); patchInfo{type patch;}}
//          inlet5{ level (2 2); patchInfo{type patch;}}
//          outlet1{ level (2 2); patchInfo{type patch;}}
//          outlet2{ level (2 2); patchInfo{type patch;}}
//          outlet3{ level (2 2); patchInfo{type patch;}}
//          outlet4{ level (2 2); patchInfo{type patch;}}
//          outlet5{ level (2 2); patchInfo{type patch;}}
         wall1{ level (2 5); patchInfo{type wall;}}
//          wall2{ level (2 2); patchInfo{type wall;}}
//          wall3{ level (2 2); patchInfo{type wall;}}
//          wall4{ level (2 2); patchInfo{type wall;}}
//          wall5{ level (2 2); patchInfo{type wall;}}
        }
        resolveFeatureAngle 15;
        refinementRegions
        {
            wake {mode inside; levels ((1e15 2));}
            verticle {mode inside; levels ((1e15 2));}
            buffer1 {mode inside; levels ((1e15 3));}
            buffer2 {mode inside; levels ((1e15 2));}
        }
       locationInMesh (0.5 0.5 -0.5);
        allowFreeStandingZoneFaces false;
    }

    snapControls
    {
        nSmoothPatch 3;
        tolerance 4.0;
        nSolveIter 20;
        nRelaxIter 20;
        nFeatureSnapIter 20;
        implicitFeatureSnap true;
        explicitFeatureSnap false;
        multiRegionFeatureSnap true;
    }

    addLayersControls
    {
        relativeSizes true;
        layers
        {
				wall1{nSurfaceLayers 5;}			
//				wall2{nSurfaceLayers 2;}			
//  			wall3{nSurfaceLayers 2;}			
//  			wall4{nSurfaceLayers 2;}			
//  			wall5{nSurfaceLayers 2;}			
          }
        expansionRatio 1.2;
        finalLayerThickness 0.3;
        minThickness 0.05;
        nGrow 0;
        featureAngle 90;
        nRelaxIter 3;
        nSmoothSurfaceNormals 1;
        nSmoothNormals 3;
        nSmoothThickness 10;
        maxFaceThicknessRatio 0.5;
        maxThicknessToMedialRatio 0.3;
        minMedialAxisAngle 90;
        nBufferCellsNoExtrude 0;
        nLayerIter 10;//50;
    }

    meshQualityControls
    {
        maxNonOrtho 65;
        maxBoundarySkewness 20;
        maxInternalSkewness 4;
        maxConcave 80;
        minVol 1e-13;
        minTetQuality -1;
        minArea -1;
        minTwist 0.01;
        minDeterminant 0.001;
        minFaceWeight 0.05;
        minVolRatio 0.01;
        minTriangleTwist -1;
        nSmoothScale 4;
        errorReduction 0.75;
        relaxed
        {
            maxNonOrtho 75;
        }
    }

    writeFlags
    (
        scalarLevels
        layerFields
    );

    mergeTolerance 1e-6;


// ************************************************************************* //
